hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_i3c.h
/*
; stm32N657_i3c.
; ==============

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_i3c equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// I3C address definitions
// -----------------------

typedef struct {
		union {
	volatile	uint32_t	CR;
	volatile	uint32_t	CR_ALTERNATE;
		};
	volatile	uint32_t	CFGR;
	volatile	uint32_t	RESERVED0[2];
	volatile	uint32_t	RDR;
	volatile	uint32_t	RDWR;
	volatile	uint32_t	TDR;
	volatile	uint32_t	TDWR;
	volatile	uint32_t	IBIDR;
	volatile	uint32_t	TGTTDR;
	volatile	uint32_t	RESERVED1[2];
	volatile	uint32_t	SR;
	volatile	uint32_t	SER;
	volatile	uint32_t	RESERVED2[2];
	volatile	uint32_t	RMR;
	volatile	uint32_t	RESERVED3[3];
	volatile	uint32_t	EVR;
	volatile	uint32_t	IER;
	volatile	uint32_t	CEVR;
	volatile	uint32_t	RESERVED4;
	volatile	uint32_t	DEVR0;
	volatile	uint32_t	DEVR1;
	volatile	uint32_t	DEVR2;
	volatile	uint32_t	DEVR3;
	volatile	uint32_t	DEVR4;
	volatile	uint32_t	RESERVED5[7];
	volatile	uint32_t	MAXRLR;
	volatile	uint32_t	MAXWLR;
	volatile	uint32_t	RESERVED6[2];
	volatile	uint32_t	TIMINGR0;
	volatile	uint32_t	TIMINGR1;
	volatile	uint32_t	TIMINGR2;
	volatile	uint32_t	RESERVED7[5];
	volatile	uint32_t	BCR;
	volatile	uint32_t	DCR;
	volatile	uint32_t	GETCAPR;
	volatile	uint32_t	CRCAPR;
	volatile	uint32_t	GETMXDSR;
	volatile	uint32_t	EPIDR;
} I3C_TypeDef;

#if (defined(__cplusplus))
#define	I3C1_NS	reinterpret_cast<I3C_TypeDef *>(0x40006000u)
#define	I3C1_S	reinterpret_cast<I3C_TypeDef *>(0x50006000u)
#define	I3C2_NS	reinterpret_cast<I3C_TypeDef *>(0x40006400u)
#define	I3C2_S	reinterpret_cast<I3C_TypeDef *>(0x50006400u)

#else
#define	I3C1_NS	((I3C_TypeDef *)0x40006000u)
#define	I3C1_S	((I3C_TypeDef *)0x50006000u)
#define	I3C2_NS	((I3C_TypeDef *)0x40006400u)
#define	I3C2_S	((I3C_TypeDef *)0x50006400u)
#endif

// CR Configuration

#define	I3C_CR_MEND														(0x1u<<31)
#define	I3C_CR_MTYPE													(0xFu<<27)
#define	I3C_CR_MTYPE_0													(0x1u<<27)
#define	I3C_CR_ADD														(0x7Fu<<17)
#define	I3C_CR_ADD_0													(0x1u<<17)
#define	I3C_CR_RNW														(0x1u<<16)
#define	I3C_CR_DCNT														(0xFFFFu<<0)
#define	I3C_CR_DCNT_0													(0x1u<<0)

#define	I3C_CR_MEND_B_0X0												(0x0u<<31)
#define	I3C_CR_MEND_B_0X1												(0x1u<<31)
#define	I3C_CR_MTYPE_B_0X0_WHEN_I3C_ACTS_AS_I3C_CONTROLLER				(0x0u<<27)
#define	I3C_CR_MTYPE_B_0X1_WHEN_I3C_ACTS_AS_I3C_CONTROLLER				(0x1u<<27)
#define	I3C_CR_MTYPE_B_0X2_WHEN_I3C_ACTS_AS_I3C_CONTROLLER				(0x2u<<27)
#define	I3C_CR_MTYPE_B_0X3_WHEN_I3C_ACTS_AS_I3C_CONTROLLER				(0x3u<<27)
#define	I3C_CR_MTYPE_B_0X4_WHEN_I3C_ACTS_AS_I3C_CONTROLLER				(0x4u<<27)
#define	I3C_CR_MTYPE_B_0X8_WHEN_I3C_ACTS_AS_I3C_TARGET					(0x8u<<27)
#define	I3C_CR_MTYPE_B_0X9_WHEN_I3C_ACTS_AS_I3C_TARGET					(0x9u<<27)
#define	I3C_CR_MTYPE_B_0XA_WHEN_I3C_ACTS_AS_I3C_TARGET					(0xAu<<27)
#define	I3C_CR_RNW_B_0X0												(0x0u<<16)
#define	I3C_CR_RNW_B_0X1												(0x1u<<16)
#define	I3C_CR_DCNT_B_0X0000											(0x0u<<0)
#define	I3C_CR_DCNT_B_0X0001											(0x1u<<0)
#define	I3C_CR_DCNT_B_0X0002											(0x2u<<0)
#define	I3C_CR_DCNT_B_0XFFFF											(0xFFFFu<<0)

// CR_ALTERNATE Configuration

#define	I3C_CR_ALTERNATE_MEND											(0x1u<<31)
#define	I3C_CR_ALTERNATE_MTYPE											(0xFu<<27)
#define	I3C_CR_ALTERNATE_MTYPE_0										(0x1u<<27)
#define	I3C_CR_ALTERNATE_CCC											(0xFFu<<16)
#define	I3C_CR_ALTERNATE_CCC_0											(0x1u<<16)
#define	I3C_CR_ALTERNATE_DCNT											(0xFFFFu<<0)
#define	I3C_CR_ALTERNATE_DCNT_0											(0x1u<<0)

#define	I3C_CR_ALTERNATE_MEND_B_0X0										(0x0u<<31)
#define	I3C_CR_ALTERNATE_MEND_B_0X1										(0x1u<<31)
#define	I3C_CR_ALTERNATE_MTYPE_B_0X6_WHEN_I3C_ACTS_AS_I3C_CONTROLLER	(0x6u<<27)
#define	I3C_CR_ALTERNATE_DCNT_B_0X0000									(0x0u<<0)
#define	I3C_CR_ALTERNATE_DCNT_B_0X0001									(0x1u<<0)
#define	I3C_CR_ALTERNATE_DCNT_B_0X0002									(0x2u<<0)
#define	I3C_CR_ALTERNATE_DCNT_B_0XFFFF									(0xFFFFu<<0)

// CFGR Configuration

#define	I3C_CFGR_TSFSET													(0x1u<<30)
#define	I3C_CFGR_CFLUSH													(0x1u<<21)
#define	I3C_CFGR_CDMAEN													(0x1u<<20)
#define	I3C_CFGR_TMODE													(0x1u<<19)
#define	I3C_CFGR_SMODE													(0x1u<<18)
#define	I3C_CFGR_SFLUSH													(0x1u<<17)
#define	I3C_CFGR_SDMAEN													(0x1u<<16)
#define	I3C_CFGR_TXTHRES												(0x1u<<14)
#define	I3C_CFGR_TXFLUSH												(0x1u<<13)
#define	I3C_CFGR_TXDMAEN												(0x1u<<12)
#define	I3C_CFGR_RXTHRES												(0x1u<<10)
#define	I3C_CFGR_RXFLUSH												(0x1u<<9)
#define	I3C_CFGR_RXDMAEN												(0x1u<<8)
#define	I3C_CFGR_HJACK													(0x1u<<7)
#define	I3C_CFGR_HKSDAEN												(0x1u<<5)
#define	I3C_CFGR_EXITPTRN												(0x1u<<4)
#define	I3C_CFGR_RSTPTRN												(0x1u<<3)
#define	I3C_CFGR_NOARBH													(0x1u<<2)
#define	I3C_CFGR_CRINIT													(0x1u<<1)
#define	I3C_CFGR_EN														(0x1u<<0)

