hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_i3c.h
#define	I3C_CFGR_TSFSET_B_0X0											(0x0u<<30)
#define	I3C_CFGR_TSFSET_B_0X1											(0x1u<<30)
#define	I3C_CFGR_CFLUSH_B_0X0											(0x0u<<21)
#define	I3C_CFGR_CFLUSH_B_0X1											(0x1u<<21)
#define	I3C_CFGR_CDMAEN_B_0X0											(0x0u<<20)
#define	I3C_CFGR_CDMAEN_B_0X1											(0x1u<<20)
#define	I3C_CFGR_TMODE_B_0X0											(0x0u<<19)
#define	I3C_CFGR_TMODE_B_0X1											(0x1u<<19)
#define	I3C_CFGR_SMODE_B_0X0											(0x0u<<18)
#define	I3C_CFGR_SMODE_B_0X1											(0x1u<<18)
#define	I3C_CFGR_SFLUSH_B_0X0											(0x0u<<17)
#define	I3C_CFGR_SFLUSH_B_0X1											(0x1u<<17)
#define	I3C_CFGR_SDMAEN_B_0X0											(0x0u<<16)
#define	I3C_CFGR_SDMAEN_B_0X1											(0x1u<<16)
#define	I3C_CFGR_TXTHRES_B_0X0											(0x0u<<14)
#define	I3C_CFGR_TXTHRES_B_0X1											(0x1u<<14)
#define	I3C_CFGR_TXFLUSH_B_0X0											(0x0u<<13)
#define	I3C_CFGR_TXFLUSH_B_0X1											(0x1u<<13)
#define	I3C_CFGR_TXDMAEN_B_0X0											(0x0u<<12)
#define	I3C_CFGR_TXDMAEN_B_0X1											(0x1u<<12)
#define	I3C_CFGR_RXTHRES_B_0X0											(0x0u<<10)
#define	I3C_CFGR_RXTHRES_B_0X1											(0x1u<<10)
#define	I3C_CFGR_RXFLUSH_B_0X0											(0x0u<<9)
#define	I3C_CFGR_RXFLUSH_B_0X1											(0x1u<<9)
#define	I3C_CFGR_RXDMAEN_B_0X0											(0x0u<<8)
#define	I3C_CFGR_RXDMAEN_B_0X1											(0x1u<<8)
#define	I3C_CFGR_HJACK_B_0X0											(0x0u<<7)
#define	I3C_CFGR_HJACK_B_0X1											(0x1u<<7)
#define	I3C_CFGR_HKSDAEN_B_0X0											(0x0u<<5)
#define	I3C_CFGR_HKSDAEN_B_0X1											(0x1u<<5)
#define	I3C_CFGR_EXITPTRN_B_0X0											(0x0u<<4)
#define	I3C_CFGR_EXITPTRN_B_0X1											(0x1u<<4)
#define	I3C_CFGR_RSTPTRN_B_0X0											(0x0u<<3)
#define	I3C_CFGR_RSTPTRN_B_0X1											(0x1u<<3)
#define	I3C_CFGR_NOARBH_B_0X0											(0x0u<<2)
#define	I3C_CFGR_NOARBH_B_0X1											(0x1u<<2)
#define	I3C_CFGR_CRINIT_B_0X0											(0x0u<<1)
#define	I3C_CFGR_CRINIT_B_0X1											(0x1u<<1)
#define	I3C_CFGR_EN_B_0X0												(0x0u<<0)
#define	I3C_CFGR_EN_B_0X1												(0x1u<<0)

// RDR Configuration

#define	I3C_RDR_RDB0													(0xFFu<<0)
#define	I3C_RDR_RDB0_0													(0x1u<<0)

// RDWR Configuration

#define	I3C_RDWR_RDB3													(0xFFu<<24)
#define	I3C_RDWR_RDB3_0													(0x1u<<24)
#define	I3C_RDWR_RDB2													(0xFFu<<16)
#define	I3C_RDWR_RDB2_0													(0x1u<<16)
#define	I3C_RDWR_RDB1													(0xFFu<<8)
#define	I3C_RDWR_RDB1_0													(0x1u<<8)
#define	I3C_RDWR_RDB0													(0xFFu<<0)
#define	I3C_RDWR_RDB0_0													(0x1u<<0)

// TDR Configuration

#define	I3C_TDR_TDB0													(0xFFu<<0)
#define	I3C_TDR_TDB0_0													(0x1u<<0)

// TDWR Configuration

#define	I3C_TDWR_TDB3													(0xFFu<<24)
#define	I3C_TDWR_TDB3_0													(0x1u<<24)
#define	I3C_TDWR_TDB2													(0xFFu<<16)
#define	I3C_TDWR_TDB2_0													(0x1u<<16)
#define	I3C_TDWR_TDB1													(0xFFu<<8)
#define	I3C_TDWR_TDB1_0													(0x1u<<8)
#define	I3C_TDWR_TDB0													(0xFFu<<0)
#define	I3C_TDWR_TDB0_0													(0x1u<<0)

// IBIDR Configuration

#define	I3C_IBIDR_IBIDB3												(0xFFu<<24)
#define	I3C_IBIDR_IBIDB3_0												(0x1u<<24)
#define	I3C_IBIDR_IBIDB2												(0xFFu<<16)
#define	I3C_IBIDR_IBIDB2_0												(0x1u<<16)
#define	I3C_IBIDR_IBIDB1												(0xFFu<<8)
#define	I3C_IBIDR_IBIDB1_0												(0x1u<<8)
#define	I3C_IBIDR_IBIDB0												(0xFFu<<0)
#define	I3C_IBIDR_IBIDB0_0												(0x1u<<0)

// TGTTDR Configuration

#define	I3C_TGTTDR_PRELOAD												(0x1u<<16)
#define	I3C_TGTTDR_TGTTDCNT												(0xFFFFu<<0)
#define	I3C_TGTTDR_TGTTDCNT_0											(0x1u<<0)

#define	I3C_TGTTDR_PRELOAD_B_0X0										(0x0u<<16)
#define	I3C_TGTTDR_PRELOAD_B_0X1										(0x1u<<16)

// SR Configuration

#define	I3C_SR_MID														(0xFFu<<24)
#define	I3C_SR_MID_0													(0x1u<<24)
#define	I3C_SR_DIR														(0x1u<<18)
#define	I3C_SR_ABT														(0x1u<<17)
#define	I3C_SR_XDCNT													(0xFFFFu<<0)
#define	I3C_SR_XDCNT_0													(0x1u<<0)

#define	I3C_SR_DIR_B_0X0												(0x0u<<18)
#define	I3C_SR_DIR_B_0X1												(0x1u<<18)
#define	I3C_SR_ABT_B_0X0												(0x0u<<17)
#define	I3C_SR_ABT_B_0X1												(0x1u<<17)

// SER Configuration

#define	I3C_SER_DERR													(0x1u<<10)
#define	I3C_SER_DNACK													(0x1u<<9)
#define	I3C_SER_ANACK													(0x1u<<8)
#define	I3C_SER_COVR													(0x1u<<7)
#define	I3C_SER_DOVR													(0x1u<<6)
#define	I3C_SER_STALL													(0x1u<<5)
#define	I3C_SER_PERR													(0x1u<<4)
#define	I3C_SER_CODERR													(0xFu<<0)
#define	I3C_SER_CODERR_0												(0x1u<<0)

#define	I3C_SER_DERR_B_0X0												(0x0u<<10)
#define	I3C_SER_DERR_B_0X1												(0x1u<<10)
#define	I3C_SER_DNACK_B_0X0												(0x0u<<9)
#define	I3C_SER_DNACK_B_0X1												(0x1u<<9)
#define	I3C_SER_ANACK_B_0X0												(0x0u<<8)
#define	I3C_SER_ANACK_B_0X1												(0x1u<<8)
#define	I3C_SER_COVR_B_0X0												(0x0u<<7)
#define	I3C_SER_COVR_B_0X1												(0x1u<<7)
#define	I3C_SER_DOVR_B_0X0												(0x0u<<6)
#define	I3C_SER_DOVR_B_0X1												(0x1u<<6)
#define	I3C_SER_STALL_B_0X0												(0x0u<<5)
#define	I3C_SER_STALL_B_0X1												(0x1u<<5)
#define	I3C_SER_PERR_B_0X0												(0x0u<<4)
#define	I3C_SER_PERR_B_0X1												(0x1u<<4)
#define	I3C_SER_CODERR_B_0X0											(0x0u<<0)
#define	I3C_SER_CODERR_B_0X1											(0x1u<<0)
#define	I3C_SER_CODERR_B_0X2											(0x2u<<0)
#define	I3C_SER_CODERR_B_0X3											(0x3u<<0)
#define	I3C_SER_CODERR_B_0X8											(0x8u<<0)
#define	I3C_SER_CODERR_B_0X9											(0x9u<<0)
#define	I3C_SER_CODERR_B_0XA											(0xAu<<0)
#define	I3C_SER_CODERR_B_0XB											(0xBu<<0)
#define	I3C_SER_CODERR_B_0XC											(0xCu<<0)
#define	I3C_SER_CODERR_B_0XD											(0xDu<<0)
#define	I3C_SER_CODERR_B_0XE											(0xEu<<0)

// RMR Configuration

#define	I3C_RMR_RADD													(0x7Fu<<17)
#define	I3C_RMR_RADD_0													(0x1u<<17)
#define	I3C_RMR_RCODE													(0xFFu<<8)
#define	I3C_RMR_RCODE_0													(0x1u<<8)
#define	I3C_RMR_IBIRDCNT												(0x7u<<0)
#define	I3C_RMR_IBIRDCNT_0												(0x1u<<0)

// EVR Configuration

#define	I3C_EVR_GRPF													(0x1u<<31)
#define	I3C_EVR_DEFF													(0x1u<<30)
#define	I3C_EVR_INTUPDF													(0x1u<<29)
#define	I3C_EVR_ASUPDF													(0x1u<<28)
#define	I3C_EVR_RSTF													(0x1u<<27)
#define	I3C_EVR_MRLUPDF													(0x1u<<26)
#define	I3C_EVR_MWLUPDF													(0x1u<<25)
#define	I3C_EVR_DAUPDF													(0x1u<<24)
#define	I3C_EVR_STAF													(0x1u<<23)
#define	I3C_EVR_GETF													(0x1u<<22)
#define	I3C_EVR_WKPF													(0x1u<<21)
#define	I3C_EVR_HJF														(0x1u<<19)
#define	I3C_EVR_CRUPDF													(0x1u<<18)
#define	I3C_EVR_CRF														(0x1u<<17)
#define	I3C_EVR_IBIENDF													(0x1u<<16)
#define	I3C_EVR_IBIF													(0x1u<<15)
#define	I3C_EVR_ERRF													(0x1u<<11)
#define	I3C_EVR_RXTGTENDF												(0x1u<<10)
#define	I3C_EVR_FCF														(0x1u<<9)
#define	I3C_EVR_RXLASTF													(0x1u<<7)
#define	I3C_EVR_TXLASTF													(0x1u<<6)
#define	I3C_EVR_RXFNEF													(0x1u<<5)
#define	I3C_EVR_TXFNFF													(0x1u<<4)
#define	I3C_EVR_SFNEF													(0x1u<<3)
#define	I3C_EVR_CFNFF													(0x1u<<2)
#define	I3C_EVR_TXFEF													(0x1u<<1)
#define	I3C_EVR_CFEF													(0x1u<<0)

// IER Configuration

#define	I3C_IER_GRPIE													(0x1u<<31)
#define	I3C_IER_DEFIE													(0x1u<<30)
#define	I3C_IER_INTUPDIE												(0x1u<<29)
#define	I3C_IER_ASUPDIE													(0x1u<<28)
#define	I3C_IER_RSTIE													(0x1u<<27)
#define	I3C_IER_MRLUPDIE												(0x1u<<26)
#define	I3C_IER_MWLUPDIE												(0x1u<<25)
#define	I3C_IER_DAUPDIE													(0x1u<<24)
#define	I3C_IER_STAIE													(0x1u<<23)
#define	I3C_IER_GETIE													(0x1u<<22)
#define	I3C_IER_WKPIE													(0x1u<<21)
#define	I3C_IER_HJIE													(0x1u<<19)
#define	I3C_IER_CRUPDIE													(0x1u<<18)
#define	I3C_IER_CRIE													(0x1u<<17)
#define	I3C_IER_IBIENDIE												(0x1u<<16)
#define	I3C_IER_IBIIE													(0x1u<<15)
#define	I3C_IER_ERRIE													(0x1u<<11)
#define	I3C_IER_RXTGTENDIE												(0x1u<<10)
#define	I3C_IER_FCIE													(0x1u<<9)
#define	I3C_IER_RXFNEIE													(0x1u<<5)
#define	I3C_IER_TXFNFIE													(0x1u<<4)
#define	I3C_IER_SFNEIE													(0x1u<<3)
#define	I3C_IER_CFNFIE													(0x1u<<2)

#define	I3C_IER_GRPIE_B_0X0												(0x0u<<31)
#define	I3C_IER_GRPIE_B_0X1												(0x1u<<31)
#define	I3C_IER_DEFIE_B_0X0												(0x0u<<30)
#define	I3C_IER_DEFIE_B_0X1												(0x1u<<30)
#define	I3C_IER_INTUPDIE_B_0X0											(0x0u<<29)
#define	I3C_IER_INTUPDIE_B_0X1											(0x1u<<29)
#define	I3C_IER_ASUPDIE_B_0X0											(0x0u<<28)
#define	I3C_IER_ASUPDIE_B_0X1											(0x1u<<28)
#define	I3C_IER_RSTIE_B_0X0												(0x0u<<27)
#define	I3C_IER_RSTIE_B_0X1												(0x1u<<27)
#define	I3C_IER_MRLUPDIE_B_0X0											(0x0u<<26)
#define	I3C_IER_MRLUPDIE_B_0X1											(0x1u<<26)
#define	I3C_IER_MWLUPDIE_B_0X0											(0x0u<<25)
#define	I3C_IER_MWLUPDIE_B_0X1											(0x1u<<25)
#define	I3C_IER_DAUPDIE_B_0X0											(0x0u<<24)
#define	I3C_IER_DAUPDIE_B_0X1											(0x1u<<24)
#define	I3C_IER_STAIE_B_0X0												(0x0u<<23)
#define	I3C_IER_STAIE_B_0X1												(0x1u<<23)
#define	I3C_IER_GETIE_B_0X0												(0x0u<<22)
#define	I3C_IER_GETIE_B_0X1												(0x1u<<22)
#define	I3C_IER_WKPIE_B_0X0												(0x0u<<21)
#define	I3C_IER_WKPIE_B_0X1												(0x1u<<21)
#define	I3C_IER_HJIE_B_0X0												(0x0u<<19)
#define	I3C_IER_HJIE_B_0X1												(0x1u<<19)
#define	I3C_IER_CRUPDIE_B_0X0											(0x0u<<18)
#define	I3C_IER_CRUPDIE_B_0X1											(0x1u<<18)
#define	I3C_IER_CRIE_B_0X0												(0x0u<<17)
#define	I3C_IER_CRIE_B_0X1												(0x1u<<17)
#define	I3C_IER_IBIENDIE_B_0X0											(0x0u<<16)
#define	I3C_IER_IBIENDIE_B_0X1											(0x1u<<16)
#define	I3C_IER_IBIIE_B_0X0												(0x0u<<15)
#define	I3C_IER_IBIIE_B_0X1												(0x1u<<15)
#define	I3C_IER_ERRIE_B_0X0												(0x0u<<11)
#define	I3C_IER_ERRIE_B_0X1												(0x1u<<11)
#define	I3C_IER_RXTGTENDIE_B_0X0										(0x0u<<10)
#define	I3C_IER_RXTGTENDIE_B_0X1										(0x1u<<10)
#define	I3C_IER_FCIE_B_0X0												(0x0u<<9)
#define	I3C_IER_FCIE_B_0X1												(0x1u<<9)
#define	I3C_IER_RXFNEIE_B_0X0											(0x0u<<5)
#define	I3C_IER_RXFNEIE_B_0X1											(0x1u<<5)
#define	I3C_IER_TXFNFIE_B_0X0											(0x0u<<4)
#define	I3C_IER_TXFNFIE_B_0X1											(0x1u<<4)
#define	I3C_IER_SFNEIE_B_0X0											(0x0u<<3)
#define	I3C_IER_SFNEIE_B_0X1											(0x1u<<3)
#define	I3C_IER_CFNFIE_B_0X0											(0x0u<<2)
#define	I3C_IER_CFNFIE_B_0X1											(0x1u<<2)

// CEVR Configuration

#define	I3C_CEVR_CGRPF													(0x1u<<31)
#define	I3C_CEVR_CDEFF													(0x1u<<30)
#define	I3C_CEVR_CINTUPDF												(0x1u<<29)
#define	I3C_CEVR_CASUPDF												(0x1u<<28)
#define	I3C_CEVR_CRSTF													(0x1u<<27)
#define	I3C_CEVR_CMRLUPDF												(0x1u<<26)
#define	I3C_CEVR_CMWLUPDF												(0x1u<<25)
#define	I3C_CEVR_CDAUPDF												(0x1u<<24)
#define	I3C_CEVR_CSTAF													(0x1u<<23)
#define	I3C_CEVR_CGETF													(0x1u<<22)
#define	I3C_CEVR_CWKPF													(0x1u<<21)
#define	I3C_CEVR_CHJF													(0x1u<<19)
#define	I3C_CEVR_CCRUPDF												(0x1u<<18)
#define	I3C_CEVR_CCRF													(0x1u<<17)
#define	I3C_CEVR_CIBIENDF												(0x1u<<16)
#define	I3C_CEVR_CIBIF													(0x1u<<15)
#define	I3C_CEVR_CERRF													(0x1u<<11)
#define	I3C_CEVR_CRXTGTENDF												(0x1u<<10)
#define	I3C_CEVR_CFCF													(0x1u<<9)

#define	I3C_CEVR_CGRPF_B_0X0											(0x0u<<31)
#define	I3C_CEVR_CGRPF_B_0X1											(0x1u<<31)
#define	I3C_CEVR_CDEFF_B_0X0											(0x0u<<30)
#define	I3C_CEVR_CDEFF_B_0X1											(0x1u<<30)
#define	I3C_CEVR_CINTUPDF_B_0X0											(0x0u<<29)
#define	I3C_CEVR_CINTUPDF_B_0X1											(0x1u<<29)
#define	I3C_CEVR_CASUPDF_B_0X0											(0x0u<<28)
#define	I3C_CEVR_CASUPDF_B_0X1											(0x1u<<28)
#define	I3C_CEVR_CRSTF_B_0X0											(0x0u<<27)
#define	I3C_CEVR_CRSTF_B_0X1											(0x1u<<27)
#define	I3C_CEVR_CMRLUPDF_B_0X0											(0x0u<<26)
#define	I3C_CEVR_CMRLUPDF_B_0X1											(0x1u<<26)
#define	I3C_CEVR_CMWLUPDF_B_0X0											(0x0u<<25)
#define	I3C_CEVR_CMWLUPDF_B_0X1											(0x1u<<25)
#define	I3C_CEVR_CDAUPDF_B_0X0											(0x0u<<24)
#define	I3C_CEVR_CDAUPDF_B_0X1											(0x1u<<24)
#define	I3C_CEVR_CSTAF_B_0X0											(0x0u<<23)
#define	I3C_CEVR_CSTAF_B_0X1											(0x1u<<23)
#define	I3C_CEVR_CGETF_B_0X0											(0x0u<<22)
#define	I3C_CEVR_CGETF_B_0X1											(0x1u<<22)
#define	I3C_CEVR_CWKPF_B_0X0											(0x0u<<21)
#define	I3C_CEVR_CWKPF_B_0X1											(0x1u<<21)
#define	I3C_CEVR_CHJF_B_0X0												(0x0u<<19)
#define	I3C_CEVR_CHJF_B_0X1												(0x1u<<19)
#define	I3C_CEVR_CCRUPDF_B_0X0											(0x0u<<18)
#define	I3C_CEVR_CCRUPDF_B_0X1											(0x1u<<18)
#define	I3C_CEVR_CCRF_B_0X0												(0x0u<<17)
#define	I3C_CEVR_CCRF_B_0X1												(0x1u<<17)
#define	I3C_CEVR_CIBIENDF_B_0X0											(0x0u<<16)
#define	I3C_CEVR_CIBIENDF_B_0X1											(0x1u<<16)
#define	I3C_CEVR_CIBIF_B_0X0											(0x0u<<15)
#define	I3C_CEVR_CIBIF_B_0X1											(0x1u<<15)
#define	I3C_CEVR_CERRF_B_0X0											(0x0u<<11)
#define	I3C_CEVR_CERRF_B_0X1											(0x1u<<11)
#define	I3C_CEVR_CRXTGTENDF_B_0X0										(0x0u<<10)
#define	I3C_CEVR_CRXTGTENDF_B_0X1										(0x1u<<10)
#define	I3C_CEVR_CFCF_B_0X0												(0x0u<<9)
#define	I3C_CEVR_CFCF_B_0X1												(0x1u<<9)

