hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_i3c.h
// DEVR0 Configuration

#define	I3C_DEVR0_RSTVAL												(0x1u<<24)
#define	I3C_DEVR0_RSTACT												(0x3u<<22)
#define	I3C_DEVR0_RSTACT_0												(0x1u<<22)
#define	I3C_DEVR0_AS													(0x3u<<20)
#define	I3C_DEVR0_AS_0													(0x1u<<20)
#define	I3C_DEVR0_HJEN													(0x1u<<19)
#define	I3C_DEVR0_CREN													(0x1u<<17)
#define	I3C_DEVR0_IBIEN													(0x1u<<16)
#define	I3C_DEVR0_DA													(0x7Fu<<1)
#define	I3C_DEVR0_DA_0													(0x1u<<1)
#define	I3C_DEVR0_DAVAL													(0x1u<<0)

#define	I3C_DEVR0_RSTACT_B_0X0											(0x0u<<22)
#define	I3C_DEVR0_RSTACT_B_0X1											(0x1u<<22)
#define	I3C_DEVR0_RSTACT_B_0X2											(0x2u<<22)
#define	I3C_DEVR0_RSTACT_B_0X3											(0x3u<<22)
#define	I3C_DEVR0_AS_B_0X0												(0x0u<<20)
#define	I3C_DEVR0_AS_B_0X1												(0x1u<<20)
#define	I3C_DEVR0_AS_B_0X2												(0x2u<<20)
#define	I3C_DEVR0_AS_B_0X3												(0x3u<<20)
#define	I3C_DEVR0_HJEN_B_0X0											(0x0u<<19)
#define	I3C_DEVR0_HJEN_B_0X1											(0x1u<<19)
#define	I3C_DEVR0_CREN_B_0X0											(0x0u<<17)
#define	I3C_DEVR0_CREN_B_0X1											(0x1u<<17)
#define	I3C_DEVR0_IBIEN_B_0X0											(0x0u<<16)
#define	I3C_DEVR0_IBIEN_B_0X1											(0x1u<<16)

// DEVR1 Configuration

#define	I3C_DEVR1_DIS													(0x1u<<31)
#define	I3C_DEVR1_SUSP													(0x1u<<19)
#define	I3C_DEVR1_IBIDEN												(0x1u<<18)
#define	I3C_DEVR1_CRACK													(0x1u<<17)
#define	I3C_DEVR1_IBIACK												(0x1u<<16)
#define	I3C_DEVR1_DA													(0x7Fu<<1)
#define	I3C_DEVR1_DA_0													(0x1u<<1)

#define	I3C_DEVR1_DIS_B_0X0												(0x0u<<31)
#define	I3C_DEVR1_DIS_B_0X1												(0x1u<<31)
#define	I3C_DEVR1_SUSP_B_0X0											(0x0u<<19)
#define	I3C_DEVR1_SUSP_B_0X1											(0x1u<<19)
#define	I3C_DEVR1_IBIDEN_B_0X0											(0x0u<<18)
#define	I3C_DEVR1_IBIDEN_B_0X1											(0x1u<<18)
#define	I3C_DEVR1_CRACK_B_0X0											(0x0u<<17)
#define	I3C_DEVR1_CRACK_B_0X1											(0x1u<<17)
#define	I3C_DEVR1_IBIACK_B_0X0											(0x0u<<16)
#define	I3C_DEVR1_IBIACK_B_0X1											(0x1u<<16)

// DEVR2 Configuration

#define	I3C_DEVR2_DIS													(0x1u<<31)
#define	I3C_DEVR2_SUSP													(0x1u<<19)
#define	I3C_DEVR2_IBIDEN												(0x1u<<18)
#define	I3C_DEVR2_CRACK													(0x1u<<17)
#define	I3C_DEVR2_IBIACK												(0x1u<<16)
#define	I3C_DEVR2_DA													(0x7Fu<<1)
#define	I3C_DEVR2_DA_0													(0x1u<<1)

#define	I3C_DEVR2_DIS_B_0X0												(0x0u<<31)
#define	I3C_DEVR2_DIS_B_0X1												(0x1u<<31)
#define	I3C_DEVR2_SUSP_B_0X0											(0x0u<<19)
#define	I3C_DEVR2_SUSP_B_0X1											(0x1u<<19)
#define	I3C_DEVR2_IBIDEN_B_0X0											(0x0u<<18)
#define	I3C_DEVR2_IBIDEN_B_0X1											(0x1u<<18)
#define	I3C_DEVR2_CRACK_B_0X0											(0x0u<<17)
#define	I3C_DEVR2_CRACK_B_0X1											(0x1u<<17)
#define	I3C_DEVR2_IBIACK_B_0X0											(0x0u<<16)
#define	I3C_DEVR2_IBIACK_B_0X1											(0x1u<<16)

// DEVR3 Configuration

#define	I3C_DEVR3_DIS													(0x1u<<31)
#define	I3C_DEVR3_SUSP													(0x1u<<19)
#define	I3C_DEVR3_IBIDEN												(0x1u<<18)
#define	I3C_DEVR3_CRACK													(0x1u<<17)
#define	I3C_DEVR3_IBIACK												(0x1u<<16)
#define	I3C_DEVR3_DA													(0x7Fu<<1)
#define	I3C_DEVR3_DA_0													(0x1u<<1)

#define	I3C_DEVR3_DIS_B_0X0												(0x0u<<31)
#define	I3C_DEVR3_DIS_B_0X1												(0x1u<<31)
#define	I3C_DEVR3_SUSP_B_0X0											(0x0u<<19)
#define	I3C_DEVR3_SUSP_B_0X1											(0x1u<<19)
#define	I3C_DEVR3_IBIDEN_B_0X0											(0x0u<<18)
#define	I3C_DEVR3_IBIDEN_B_0X1											(0x1u<<18)
#define	I3C_DEVR3_CRACK_B_0X0											(0x0u<<17)
#define	I3C_DEVR3_CRACK_B_0X1											(0x1u<<17)
#define	I3C_DEVR3_IBIACK_B_0X0											(0x0u<<16)
#define	I3C_DEVR3_IBIACK_B_0X1											(0x1u<<16)

// DEVR4 Configuration

#define	I3C_DEVR4_DIS													(0x1u<<31)
#define	I3C_DEVR4_SUSP													(0x1u<<19)
#define	I3C_DEVR4_IBIDEN												(0x1u<<18)
#define	I3C_DEVR4_CRACK													(0x1u<<17)
#define	I3C_DEVR4_IBIACK												(0x1u<<16)
#define	I3C_DEVR4_DA													(0x7Fu<<1)
#define	I3C_DEVR4_DA_0													(0x1u<<1)

#define	I3C_DEVR4_DIS_B_0X0												(0x0u<<31)
#define	I3C_DEVR4_DIS_B_0X1												(0x1u<<31)
#define	I3C_DEVR4_SUSP_B_0X0											(0x0u<<19)
#define	I3C_DEVR4_SUSP_B_0X1											(0x1u<<19)
#define	I3C_DEVR4_IBIDEN_B_0X0											(0x0u<<18)
#define	I3C_DEVR4_IBIDEN_B_0X1											(0x1u<<18)
#define	I3C_DEVR4_CRACK_B_0X0											(0x0u<<17)
#define	I3C_DEVR4_CRACK_B_0X1											(0x1u<<17)
#define	I3C_DEVR4_IBIACK_B_0X0											(0x0u<<16)
#define	I3C_DEVR4_IBIACK_B_0X1											(0x1u<<16)

// MAXRLR Configuration

#define	I3C_MAXRLR_IBIP													(0x7u<<16)
#define	I3C_MAXRLR_IBIP_0												(0x1u<<16)
#define	I3C_MAXRLR_MRL													(0xFFFFu<<0)
#define	I3C_MAXRLR_MRL_0												(0x1u<<0)

#define	I3C_MAXRLR_IBIP_B_0X0											(0x0u<<16)
#define	I3C_MAXRLR_IBIP_B_0X1											(0x1u<<16)
#define	I3C_MAXRLR_IBIP_B_0X2											(0x2u<<16)
#define	I3C_MAXRLR_IBIP_B_0X3											(0x3u<<16)
#define	I3C_MAXRLR_IBIP_B_0X4											(0x4u<<16)

// MAXWLR Configuration

#define	I3C_MAXWLR_MWL													(0xFFFFu<<0)
#define	I3C_MAXWLR_MWL_0												(0x1u<<0)

// TIMINGR0 Configuration

#define	I3C_TIMINGR0_SCLH_I2C											(0xFFu<<24)
#define	I3C_TIMINGR0_SCLH_I2C_0											(0x1u<<24)
#define	I3C_TIMINGR0_SCLL_OD											(0xFFu<<16)
#define	I3C_TIMINGR0_SCLL_OD_0											(0x1u<<16)
#define	I3C_TIMINGR0_SCLH_I3C											(0xFFu<<8)
#define	I3C_TIMINGR0_SCLH_I3C_0											(0x1u<<8)
#define	I3C_TIMINGR0_SCLL_PP											(0xFFu<<0)
#define	I3C_TIMINGR0_SCLL_PP_0											(0x1u<<0)

// TIMINGR1 Configuration

#define	I3C_TIMINGR1_SDA_HD												(0x1u<<28)
#define	I3C_TIMINGR1_FREE												(0x7Fu<<16)
#define	I3C_TIMINGR1_FREE_0												(0x1u<<16)
#define	I3C_TIMINGR1_ASNCR												(0x3u<<8)
#define	I3C_TIMINGR1_ASNCR_0											(0x1u<<8)
#define	I3C_TIMINGR1_AVAL												(0xFFu<<0)
#define	I3C_TIMINGR1_AVAL_0												(0x1u<<0)

// TIMINGR2 Configuration

