hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_i3c.h
#define	I3C_TIMINGR2_STALL												(0xFFu<<8)
#define	I3C_TIMINGR2_STALL_0											(0x1u<<8)
#define	I3C_TIMINGR2_STALLA												(0x1u<<3)
#define	I3C_TIMINGR2_STALLC												(0x1u<<2)
#define	I3C_TIMINGR2_STALLD												(0x1u<<1)
#define	I3C_TIMINGR2_STALLT												(0x1u<<0)

#define	I3C_TIMINGR2_STALLA_B_0X0										(0x0u<<3)
#define	I3C_TIMINGR2_STALLA_B_0X1										(0x1u<<3)
#define	I3C_TIMINGR2_STALLC_B_0X0										(0x0u<<2)
#define	I3C_TIMINGR2_STALLC_B_0X1										(0x1u<<2)
#define	I3C_TIMINGR2_STALLD_B_0X0										(0x0u<<1)
#define	I3C_TIMINGR2_STALLD_B_0X1										(0x1u<<1)
#define	I3C_TIMINGR2_STALLT_B_0X0										(0x0u<<0)
#define	I3C_TIMINGR2_STALLT_B_0X1										(0x1u<<0)

// BCR Configuration

#define	I3C_BCR_BCR6													(0x1u<<6)
#define	I3C_BCR_BCR2													(0x1u<<2)
#define	I3C_BCR_BCR0													(0x1u<<0)

#define	I3C_BCR_BCR6_B_0X0												(0x0u<<6)
#define	I3C_BCR_BCR6_B_0X1												(0x1u<<6)
#define	I3C_BCR_BCR2_B_0X0												(0x0u<<2)
#define	I3C_BCR_BCR2_B_0X1												(0x1u<<2)
#define	I3C_BCR_BCR0_B_0X0												(0x0u<<0)
#define	I3C_BCR_BCR0_B_0X1												(0x1u<<0)

// DCR Configuration

#define	I3C_DCR_DCR														(0xFFu<<0)
#define	I3C_DCR_DCR_0													(0x1u<<0)

#define	I3C_DCR_DCR_B_0X00												(0x0u<<0)

// GETCAPR Configuration

#define	I3C_GETCAPR_CAPPEND												(0x1u<<14)

#define	I3C_GETCAPR_CAPPEND_B_0X0										(0x0u<<14)
#define	I3C_GETCAPR_CAPPEND_B_0X1										(0x1u<<14)

// CRCAPR Configuration

#define	I3C_CRCAPR_CAPGRP												(0x1u<<9)
#define	I3C_CRCAPR_CAPDHOFF												(0x1u<<3)

#define	I3C_CRCAPR_CAPGRP_B_0X0											(0x0u<<9)
#define	I3C_CRCAPR_CAPGRP_B_0X1											(0x1u<<9)
#define	I3C_CRCAPR_CAPDHOFF_B_0X0										(0x0u<<3)
#define	I3C_CRCAPR_CAPDHOFF_B_0X1										(0x1u<<3)

// GETMXDSR Configuration

#define	I3C_GETMXDSR_TSCO												(0x1u<<24)
#define	I3C_GETMXDSR_RDTURN												(0xFFu<<16)
#define	I3C_GETMXDSR_RDTURN_0											(0x1u<<16)
#define	I3C_GETMXDSR_FMT												(0x3u<<8)
#define	I3C_GETMXDSR_FMT_0												(0x1u<<8)
#define	I3C_GETMXDSR_HOFFAS												(0x3u<<0)
#define	I3C_GETMXDSR_HOFFAS_0											(0x1u<<0)

#define	I3C_GETMXDSR_TSCO_B_0X0											(0x0u<<24)
#define	I3C_GETMXDSR_TSCO_B_0X1											(0x1u<<24)
#define	I3C_GETMXDSR_FMT_B_0X0											(0x0u<<8)
#define	I3C_GETMXDSR_FMT_B_0X1											(0x1u<<8)
#define	I3C_GETMXDSR_FMT_B_0X2											(0x2u<<8)
#define	I3C_GETMXDSR_FMT_B_0X3											(0x3u<<8)
#define	I3C_GETMXDSR_HOFFAS_B_0X0										(0x0u<<0)
#define	I3C_GETMXDSR_HOFFAS_B_0X1										(0x1u<<0)
#define	I3C_GETMXDSR_HOFFAS_B_0X2										(0x2u<<0)
#define	I3C_GETMXDSR_HOFFAS_B_0X3										(0x3u<<0)

// EPIDR Configuration

#define	I3C_EPIDR_MIPIMID												(0x7FFFu<<17)
#define	I3C_EPIDR_MIPIMID_0												(0x1u<<17)
#define	I3C_EPIDR_IDTSEL												(0x1u<<16)
#define	I3C_EPIDR_MIPIID												(0xFu<<12)
#define	I3C_EPIDR_MIPIID_0												(0x1u<<12)
